Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEray_regdef.h
/** \brief Message Buffer Status Changed Interrupt Control 2 */
typedef struct _Ifx_ERAY_MSIC2_Bits
{
    Ifx_UReg_32Bit MSIP32:1;          /**< \brief [0:0] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP33:1;          /**< \brief [1:1] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP34:1;          /**< \brief [2:2] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP35:1;          /**< \brief [3:3] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP36:1;          /**< \brief [4:4] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP37:1;          /**< \brief [5:5] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP38:1;          /**< \brief [6:6] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP39:1;          /**< \brief [7:7] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP40:1;          /**< \brief [8:8] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP41:1;          /**< \brief [9:9] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP42:1;          /**< \brief [10:10] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP43:1;          /**< \brief [11:11] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP44:1;          /**< \brief [12:12] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP45:1;          /**< \brief [13:13] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP46:1;          /**< \brief [14:14] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP47:1;          /**< \brief [15:15] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP48:1;          /**< \brief [16:16] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP49:1;          /**< \brief [17:17] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP50:1;          /**< \brief [18:18] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP51:1;          /**< \brief [19:19] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP52:1;          /**< \brief [20:20] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP53:1;          /**< \brief [21:21] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP54:1;          /**< \brief [22:22] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP55:1;          /**< \brief [23:23] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP56:1;          /**< \brief [24:24] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP57:1;          /**< \brief [25:25] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP58:1;          /**< \brief [26:26] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP59:1;          /**< \brief [27:27] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP60:1;          /**< \brief [28:28] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP61:1;          /**< \brief [29:29] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP62:1;          /**< \brief [30:30] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
    Ifx_UReg_32Bit MSIP63:1;          /**< \brief [31:31] Message Buffer Status Changed Interrupt Pointer ${n} (n = 32-63) - MSIP${n} (rh) */
} Ifx_ERAY_MSIC2_Bits;

/** \brief Message Buffer Status Changed Interrupt Control 3 */
typedef struct _Ifx_ERAY_MSIC3_Bits
{
    Ifx_UReg_32Bit MSIP64:1;          /**< \brief [0:0] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP65:1;          /**< \brief [1:1] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP66:1;          /**< \brief [2:2] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP67:1;          /**< \brief [3:3] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP68:1;          /**< \brief [4:4] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP69:1;          /**< \brief [5:5] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP70:1;          /**< \brief [6:6] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP71:1;          /**< \brief [7:7] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP72:1;          /**< \brief [8:8] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP73:1;          /**< \brief [9:9] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP74:1;          /**< \brief [10:10] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP75:1;          /**< \brief [11:11] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP76:1;          /**< \brief [12:12] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP77:1;          /**< \brief [13:13] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP78:1;          /**< \brief [14:14] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP79:1;          /**< \brief [15:15] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP80:1;          /**< \brief [16:16] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP81:1;          /**< \brief [17:17] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP82:1;          /**< \brief [18:18] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP83:1;          /**< \brief [19:19] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP84:1;          /**< \brief [20:20] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP85:1;          /**< \brief [21:21] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP86:1;          /**< \brief [22:22] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP87:1;          /**< \brief [23:23] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP88:1;          /**< \brief [24:24] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP89:1;          /**< \brief [25:25] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP90:1;          /**< \brief [26:26] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP91:1;          /**< \brief [27:27] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP92:1;          /**< \brief [28:28] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP93:1;          /**< \brief [29:29] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP94:1;          /**< \brief [30:30] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP95:1;          /**< \brief [31:31] Message Buffer Status Changed Interrupt Pointer ${n} (n = 64-95) - MSIP${n} (rw) */
} Ifx_ERAY_MSIC3_Bits;

