Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEray_regdef.h
/** \brief Message Buffer Status Changed Interrupt Control 4 */
typedef struct _Ifx_ERAY_MSIC4_Bits
{
    Ifx_UReg_32Bit MSIP96:1;          /**< \brief [0:0] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP97:1;          /**< \brief [1:1] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP98:1;          /**< \brief [2:2] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP99:1;          /**< \brief [3:3] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP100:1;         /**< \brief [4:4] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP101:1;         /**< \brief [5:5] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP102:1;         /**< \brief [6:6] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP103:1;         /**< \brief [7:7] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP104:1;         /**< \brief [8:8] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP105:1;         /**< \brief [9:9] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP106:1;         /**< \brief [10:10] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP107:1;         /**< \brief [11:11] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP108:1;         /**< \brief [12:12] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP109:1;         /**< \brief [13:13] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP110:1;         /**< \brief [14:14] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP111:1;         /**< \brief [15:15] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP112:1;         /**< \brief [16:16] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP113:1;         /**< \brief [17:17] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP114:1;         /**< \brief [18:18] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP115:1;         /**< \brief [19:19] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP116:1;         /**< \brief [20:20] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP117:1;         /**< \brief [21:21] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP118:1;         /**< \brief [22:22] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP119:1;         /**< \brief [23:23] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP120:1;         /**< \brief [24:24] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP121:1;         /**< \brief [25:25] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP122:1;         /**< \brief [26:26] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP123:1;         /**< \brief [27:27] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP124:1;         /**< \brief [28:28] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP125:1;         /**< \brief [29:29] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP126:1;         /**< \brief [30:30] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
    Ifx_UReg_32Bit MSIP127:1;         /**< \brief [31:31] Message Buffer Status Changed Interrupt Pointer ${n} (n = 96-127) - MSIP${n} (rw) */
} Ifx_ERAY_MSIC4_Bits;

/** \brief Macrotick and Cycle Counter Value */
typedef struct _Ifx_ERAY_MTCCV_Bits
{
    Ifx_UReg_32Bit MTV:14;            /**< \brief [13:0] Macrotick Value(vMacrotick) - MTV (rh) */
    Ifx_UReg_32Bit reserved_14:2;     /**< \brief [15:14] \internal Reserved */
    Ifx_UReg_32Bit CCV:6;             /**< \brief [21:16] Cycle Counter Value(vCycleCounter) - CCV (rh) */
    Ifx_UReg_32Bit reserved_22:10;    /**< \brief [31:22] \internal Reserved */
} Ifx_ERAY_MTCCV_Bits;

/** \brief New Data Register 1 */
typedef struct _Ifx_ERAY_NDAT1_Bits
{
    Ifx_UReg_32Bit ND0:1;             /**< \brief [0:0] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND1:1;             /**< \brief [1:1] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND2:1;             /**< \brief [2:2] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND3:1;             /**< \brief [3:3] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND4:1;             /**< \brief [4:4] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND5:1;             /**< \brief [5:5] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND6:1;             /**< \brief [6:6] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND7:1;             /**< \brief [7:7] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND8:1;             /**< \brief [8:8] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND9:1;             /**< \brief [9:9] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND10:1;            /**< \brief [10:10] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND11:1;            /**< \brief [11:11] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND12:1;            /**< \brief [12:12] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND13:1;            /**< \brief [13:13] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND14:1;            /**< \brief [14:14] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND15:1;            /**< \brief [15:15] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND16:1;            /**< \brief [16:16] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND17:1;            /**< \brief [17:17] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND18:1;            /**< \brief [18:18] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND19:1;            /**< \brief [19:19] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND20:1;            /**< \brief [20:20] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND21:1;            /**< \brief [21:21] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND22:1;            /**< \brief [22:22] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND23:1;            /**< \brief [23:23] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND24:1;            /**< \brief [24:24] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND25:1;            /**< \brief [25:25] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND26:1;            /**< \brief [26:26] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND27:1;            /**< \brief [27:27] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND28:1;            /**< \brief [28:28] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND29:1;            /**< \brief [29:29] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND30:1;            /**< \brief [30:30] New Data ${n} (n = 0-31) - ND${n} (rh) */
    Ifx_UReg_32Bit ND31:1;            /**< \brief [31:31] New Data ${n} (n = 0-31) - ND${n} (rh) */
} Ifx_ERAY_NDAT1_Bits;

/** \brief New Data Register 2 */
typedef struct _Ifx_ERAY_NDAT2_Bits
{
    Ifx_UReg_32Bit ND32:1;            /**< \brief [0:0] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND33:1;            /**< \brief [1:1] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND34:1;            /**< \brief [2:2] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND35:1;            /**< \brief [3:3] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND36:1;            /**< \brief [4:4] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND37:1;            /**< \brief [5:5] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND38:1;            /**< \brief [6:6] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND39:1;            /**< \brief [7:7] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND40:1;            /**< \brief [8:8] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND41:1;            /**< \brief [9:9] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND42:1;            /**< \brief [10:10] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND43:1;            /**< \brief [11:11] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND44:1;            /**< \brief [12:12] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND45:1;            /**< \brief [13:13] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND46:1;            /**< \brief [14:14] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND47:1;            /**< \brief [15:15] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND48:1;            /**< \brief [16:16] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND49:1;            /**< \brief [17:17] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND50:1;            /**< \brief [18:18] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND51:1;            /**< \brief [19:19] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND52:1;            /**< \brief [20:20] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND53:1;            /**< \brief [21:21] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND54:1;            /**< \brief [22:22] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND55:1;            /**< \brief [23:23] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND56:1;            /**< \brief [24:24] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND57:1;            /**< \brief [25:25] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND58:1;            /**< \brief [26:26] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND59:1;            /**< \brief [27:27] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND60:1;            /**< \brief [28:28] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND61:1;            /**< \brief [29:29] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND62:1;            /**< \brief [30:30] New Data ${n} (n = 32-63) - ND${n} (rh) */
    Ifx_UReg_32Bit ND63:1;            /**< \brief [31:31] New Data ${n} (n = 32-63) - ND${n} (rh) */
} Ifx_ERAY_NDAT2_Bits;

