Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEray_regdef.h
/** \brief New Data Register 3 */
typedef struct _Ifx_ERAY_NDAT3_Bits
{
    Ifx_UReg_32Bit ND64:1;            /**< \brief [0:0] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND65:1;            /**< \brief [1:1] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND66:1;            /**< \brief [2:2] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND67:1;            /**< \brief [3:3] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND68:1;            /**< \brief [4:4] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND69:1;            /**< \brief [5:5] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND70:1;            /**< \brief [6:6] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND71:1;            /**< \brief [7:7] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND72:1;            /**< \brief [8:8] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND73:1;            /**< \brief [9:9] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND74:1;            /**< \brief [10:10] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND75:1;            /**< \brief [11:11] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND76:1;            /**< \brief [12:12] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND77:1;            /**< \brief [13:13] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND78:1;            /**< \brief [14:14] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND79:1;            /**< \brief [15:15] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND80:1;            /**< \brief [16:16] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND81:1;            /**< \brief [17:17] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND82:1;            /**< \brief [18:18] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND83:1;            /**< \brief [19:19] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND84:1;            /**< \brief [20:20] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND85:1;            /**< \brief [21:21] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND86:1;            /**< \brief [22:22] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND87:1;            /**< \brief [23:23] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND88:1;            /**< \brief [24:24] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND89:1;            /**< \brief [25:25] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND90:1;            /**< \brief [26:26] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND91:1;            /**< \brief [27:27] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND92:1;            /**< \brief [28:28] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND93:1;            /**< \brief [29:29] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND94:1;            /**< \brief [30:30] New Data ${n} (n = 64-95) - ND${n} (rh) */
    Ifx_UReg_32Bit ND95:1;            /**< \brief [31:31] New Data ${n} (n = 64-95) - ND${n} (rh) */
} Ifx_ERAY_NDAT3_Bits;

/** \brief New Data Register 4 */
typedef struct _Ifx_ERAY_NDAT4_Bits
{
    Ifx_UReg_32Bit ND96:1;            /**< \brief [0:0] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND97:1;            /**< \brief [1:1] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND98:1;            /**< \brief [2:2] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND99:1;            /**< \brief [3:3] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND100:1;           /**< \brief [4:4] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND101:1;           /**< \brief [5:5] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND102:1;           /**< \brief [6:6] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND103:1;           /**< \brief [7:7] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND104:1;           /**< \brief [8:8] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND105:1;           /**< \brief [9:9] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND106:1;           /**< \brief [10:10] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND107:1;           /**< \brief [11:11] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND108:1;           /**< \brief [12:12] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND109:1;           /**< \brief [13:13] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND110:1;           /**< \brief [14:14] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND111:1;           /**< \brief [15:15] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND112:1;           /**< \brief [16:16] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND113:1;           /**< \brief [17:17] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND114:1;           /**< \brief [18:18] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND115:1;           /**< \brief [19:19] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND116:1;           /**< \brief [20:20] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND117:1;           /**< \brief [21:21] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND118:1;           /**< \brief [22:22] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND119:1;           /**< \brief [23:23] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND120:1;           /**< \brief [24:24] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND121:1;           /**< \brief [25:25] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND122:1;           /**< \brief [26:26] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND123:1;           /**< \brief [27:27] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND124:1;           /**< \brief [28:28] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND125:1;           /**< \brief [29:29] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND126:1;           /**< \brief [30:30] New Data ${n} (n = 96-127) - ND${n} (rh) */
    Ifx_UReg_32Bit ND127:1;           /**< \brief [31:31] New Data ${n} (n = 96-127) - ND${n} (rh) */
} Ifx_ERAY_NDAT4_Bits;

/** \brief New Data Interrupt Control 1 */
typedef struct _Ifx_ERAY_NDIC1_Bits
{
    Ifx_UReg_32Bit NDIP0:1;           /**< \brief [0:0] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP1:1;           /**< \brief [1:1] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP2:1;           /**< \brief [2:2] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP3:1;           /**< \brief [3:3] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP4:1;           /**< \brief [4:4] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP5:1;           /**< \brief [5:5] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP6:1;           /**< \brief [6:6] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP7:1;           /**< \brief [7:7] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP8:1;           /**< \brief [8:8] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP9:1;           /**< \brief [9:9] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP10:1;          /**< \brief [10:10] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP11:1;          /**< \brief [11:11] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP12:1;          /**< \brief [12:12] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP13:1;          /**< \brief [13:13] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP14:1;          /**< \brief [14:14] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP15:1;          /**< \brief [15:15] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP16:1;          /**< \brief [16:16] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP17:1;          /**< \brief [17:17] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP18:1;          /**< \brief [18:18] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP19:1;          /**< \brief [19:19] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP20:1;          /**< \brief [20:20] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP21:1;          /**< \brief [21:21] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP22:1;          /**< \brief [22:22] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP23:1;          /**< \brief [23:23] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP24:1;          /**< \brief [24:24] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP25:1;          /**< \brief [25:25] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP26:1;          /**< \brief [26:26] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP27:1;          /**< \brief [27:27] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP28:1;          /**< \brief [28:28] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP29:1;          /**< \brief [29:29] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP30:1;          /**< \brief [30:30] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP31:1;          /**< \brief [31:31] New Data Interrupt Pointer ${n} (n = 0-31) - NDIP${n} (rw) */
} Ifx_ERAY_NDIC1_Bits;

/** \brief New Data Interrupt Control 2 */
typedef struct _Ifx_ERAY_NDIC2_Bits
{
    Ifx_UReg_32Bit NDIP32:1;          /**< \brief [0:0] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP33:1;          /**< \brief [1:1] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP34:1;          /**< \brief [2:2] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP35:1;          /**< \brief [3:3] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP36:1;          /**< \brief [4:4] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP37:1;          /**< \brief [5:5] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP38:1;          /**< \brief [6:6] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP39:1;          /**< \brief [7:7] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP40:1;          /**< \brief [8:8] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP41:1;          /**< \brief [9:9] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP42:1;          /**< \brief [10:10] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP43:1;          /**< \brief [11:11] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP44:1;          /**< \brief [12:12] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP45:1;          /**< \brief [13:13] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP46:1;          /**< \brief [14:14] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP47:1;          /**< \brief [15:15] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP48:1;          /**< \brief [16:16] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP49:1;          /**< \brief [17:17] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP50:1;          /**< \brief [18:18] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP51:1;          /**< \brief [19:19] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP52:1;          /**< \brief [20:20] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP53:1;          /**< \brief [21:21] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP54:1;          /**< \brief [22:22] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP55:1;          /**< \brief [23:23] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP56:1;          /**< \brief [24:24] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP57:1;          /**< \brief [25:25] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP58:1;          /**< \brief [26:26] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP59:1;          /**< \brief [27:27] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP60:1;          /**< \brief [28:28] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP61:1;          /**< \brief [29:29] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP62:1;          /**< \brief [30:30] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
    Ifx_UReg_32Bit NDIP63:1;          /**< \brief [31:31] New Data Interrupt Pointer ${n} (n = 32-63) - NDIP${n} (rw) */
} Ifx_ERAY_NDIC2_Bits;

